/*
############################################ ЗАДАНИЕ ###########################################
			Файловый ввод - вывод с применением потоков
	1. Написать программу, которая подсчитывает количество строк
и количество слов в текстовом файле.	
################################################################################################
	ГОТОВО
*/

#include <iostream>
#include <Windows.h>
#include <fstream>
#include <string>
using namespace std;

int main()
{
	SetConsoleCP(1251);
	/*
	Задает кодовую страницу ввода, используемую консолью, связанной с вызывающим процессом.
	Консоль использует страницу входного кода для преобразования ввода с клавиатуры
	в соответствующее символьное значение.
	*/
	SetConsoleOutputCP(1251);
	/*
	Задает выходную кодовую страницу, используемую консолью, связанной с вызывающим процессом.
	Консоль использует свою кодовую страницу вывода для преобразования символьных значений,
	записанных различными функциями вывода, в изображения, отображаемые в окне консоли.
	*/

	cout << "Введите путь: "; // 1.txt
	string str;
	cin >> str;
	
	ifstream f_read(str, ios::in);

	if (!f_read.is_open()) // если открытие файла завершилось неудачей - выходим
	{
		cout << "Error!\n";
		return 0;
	}

	int line_count = 0;
	int word_count = 0;
	char buffer[1000]{};
	bool inWord = false;

	while (!f_read.eof())
	{
		line_count++;
		f_read.getline(buffer, 1000);

		for (int i = 0; i < strlen(buffer) + 1 && buffer[i] != '\0'; i++)
		{
			if (buffer[i] == ' ')
			{
				inWord = false;
			}
			else if (!inWord)
			{
				inWord = true;
				word_count++;
			}
		}
		inWord = false;
	}

	f_read.close();

	cout << "Слов в файле: " << word_count << endl;
	cout << "Строк в файле: " << line_count << endl;
	return 0;
}