/*
############################################ ЗАДАНИЕ ###########################################
			Файловый ввод - вывод с применением потоков	
	5. Написать программу, которая считывает текст из файла и
выводит в другой файл слова из этого текста, расположив
слова в порядке убывания частоты их появления.При этом
для каждого слова необходимо напечатать число его
появлений в исходном файле
################################################################################################
подсчитать кол-во символов в файле(есть метод выдающий кол-во символов в файле) и выделить под него столько же памяти, а там уже подсчитывать
по 3 примеру преподавателя можно делать
*/

#include <iostream>

int main()
{

}